<?php

/*
===========================================================

	프로젝트 이름 : Piree WON Program PLUS G5 (유료) 

	만든사람 : 피리

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2014년 04월 13일 일요일 오후 13시 51분, 날씨 맑고 더움

	저 작 권 : Copyright ⓒ 2014 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 > 라이브러리
===========================================================


*/


	#########################################################
	# 시작 => 선처리
	#########################################################

	//=======================================================
	// 개별_페이지__접근_불가
	IF (!defined('_GNUBOARD_'))										EXIT;

	#########################################################
	# 끝 => 선처리
	#########################################################






	#########################################################
	# 시작 => 공통
	#########################################################

			#####################################################
			# 시작 => 기본_상수
			#####################################################

			//===================================================
			// 피리__무료__프로그램_그룹_번호
			define('G_PLUS_FREE_N', '760');


			//===================================================
			// 피리__유료__프로그램_그룹_번호
			define('G_PLUS_PROG_N', '770');


			//===================================================
			// 피리__일반_웹_무료_프로그램__그룹_대표_번호
			define('PIREE_PROG_FREE_MENU_N', '760001');


			//===================================================
			// 피리__일반_웹_유료_프로그램__그룹_대표_번호
			define('PIREE_PROG_PLUS_MENU_N', '770001');


			//===================================================
			// PIREE__PHP_WEB_PROGRAM
			// 2014.02.26 07:47

			//===================================================
			// 디렉토리
			define('PIREE_DIR',							'piree');
			define('PIREE_LIB_DIR',					'_lib');
			define('PIREE_CONFIG_DIR',			'_config');
			define('PIREE_CSS_DIR',					'_css');
			define('PIREE_JS_DIR',					'_js');
			define('PIREE_IMAGE_DIR',				'_image');
			define('PIREE_SKIN_PC_DIR',			'_skin_pc');
			define('PIREE_SKIN_MOBILE_DIR',	'_skin_mobile');


			//===================================================
			// URL
			define('PIREE_URL',							G5_URL."/".PIREE_DIR);
			define('PIREE_LIB_URL',					PIREE_URL.'/'.PIREE_LIB_DIR);
			define('PIREE_CONFIG_URL',			PIREE_URL.'/'.PIREE_CONFIG_DIR);
			define('PIREE_CSS_URL',					PIREE_URL.'/'.PIREE_CSS_DIR);
			define('PIREE_JS_URL',					PIREE_URL.'/'.PIREE_JS_DIR);
			define('PIREE_IMAGE_URL',				PIREE_URL.'/'.PIREE_IMAGE_DIR);
			define('PIREE_SKIN_PC_URL',			PIREE_URL.'/'.PIREE_SKIN_PC_DIR);
			define('PIREE_SKIN_MOBILE_URL',	PIREE_URL.'/'.PIREE_SKIN_MOBILE_DIR);


			//===================================================
			// PATH
			define('PIREE_PATH',							G5_PATH."/".PIREE_DIR);
			define('PIREE_LIB_PATH',					PIREE_PATH.'/'.PIREE_LIB_DIR);
			define('PIREE_CONFIG_PATH',				PIREE_PATH.'/'.PIREE_CONFIG_DIR);
			define('PIREE_CSS_PATH',					PIREE_PATH.'/'.PIREE_CSS_DIR);
			define('PIREE_JS_PATH',						PIREE_PATH.'/'.PIREE_JS_DIR);
			define('PIREE_IMAGE_PATH',				PIREE_PATH.'/'.PIREE_IMAGE_DIR);
			define('PIREE_SKIN_PC_PATH',			PIREE_PATH.'/'.PIREE_SKIN_PC_DIR);
			define('PIREE_SKIN_MOBILE_PATH',	PIREE_PATH.'/'.PIREE_SKIN_MOBILE_DIR);

			#####################################################
			# 끝 => 기본_상수
			#####################################################



			#####################################################
			# 시작 => 테이블__이름
			#####################################################

			//===================================================
			// 피리_프로그램__테이블
			$piree_table['program'] = G5_TABLE_PREFIX.'_piree__program';


			//===================================================
			// 달력__테이블
			$piree_table['calendar'] = G5_TABLE_PREFIX.'_piree__calendar';


			//===================================================
			// 게시판__확장__기능__테이블
			$piree_table['gnu_board_extend'] = G5_TABLE_PREFIX.'_piree_'.G_PLUS_PROG_N.'_gnu_board_extend';

			#####################################################
			# 끝 => 테이블__이름
			#####################################################



			#####################################################
			# 시작 => 행의_처번째_결과__가져오기
			#####################################################
			function sql_efv($sql, $error=TRUE)
			{

				$state = sql_query($sql, $error);
				$row	 = @mysql_fetch_array($state);
				return $row[0];

			}
			#####################################################
			# 끝 => 행의_처번째_결과__가져오기
			#####################################################



			#####################################################
			# 시작 => 페이지_이동
			#####################################################
			function go_url($go_url_s, $go_time_n)
			{

					// 이동할_URL
					$go_url_s = str_replace("&amp;", "&", $go_url_s);

					// 이동_대기_시간
					IF (!$go_time_n || $go_time_n < 1)				 $go_time_n = 1;

					// 페이지_이동
					echo '<meta http-equiv="refresh" content="'.$go_time_n.';url='.$go_url_s.'" />';
					EXIT;

			}
			#####################################################
			# 끝 => 페이지_이동
			#####################################################



			#####################################################
			# 시작 => 배열에서 정보 뽑아내기
			#####################################################
			function get__array_value($arrs, $fd_name, $var_val)
			{

				//=================================================
				// 넘겨줄_값
				$get__val = 0;


				//=================================================
				// 시작 => 배열이면
				IF (is_array($arrs))
				{

					//===============================================
					// 시작 => 조건_필드__있으면
					IF ($fd_name)
					{

						//=============================================
						// 시작 => 조건_값__있으면
						IF ($var_val)
						{

							//===========================================
							// 시작 => 배열_건수__있으면
							IF (count($arrs) > 0)
							{

								//=========================================
								// 시작 => 원하는_정보__가져오는_방식
								SWITCH ($fd_name)
								{

									//=======================================
									// 시작 => 번호_로__이름__알아내기
									CASE "num_name" :

										WHILE (list($key, $val) = each($arrs))
										{
											// 번호_가__같으면
											IF ($var_val == $val["num"])	 				$get__val = $val["name"];
										}

									BREAK;
									// 끝 => 번호_로__이름__알아내기
									//=======================================


									//=======================================
									// 시작 => 번호_로__메모__알아내기
									CASE "num_memo" :

										WHILE (list($key, $val) = each($arrs))
										{
											// 번호_가__같으면
											IF ($var_val == $val["num"])					$get__val = $val["memo"];
										}

									BREAK;
									// 끝 => 번호_로__메모__알아내기
									//=======================================


									//=======================================
									// 시작 => 번호_로__코드__알아내기
									CASE "num_code" :

										WHILE (list($key, $val) = each($arrs))
										{
											// 번호_가__같으면
											IF ($var_val == $val["num"])					$get__val = $val["code"];
										}

									BREAK;
									// 끝 => 번호_로__코드__알아내기
									//=======================================


									//=======================================
									// 시작 => 코드_로__번호__알아내기
									CASE "code_num" :

										WHILE (list($key, $val) = each($arrs))
										{
											//===================================
											// 코드_가__같으면
											IF ($var_val == $val["code"])					$get__val = $val["num"];
										}

									BREAK;
									// 끝 => 코드_로__번호__알아내기
									//=======================================


									//=======================================
									// 시작 => 코드_로__이름__알아내기
									CASE "code_name" :

										WHILE (list($key, $val) = each($arrs))
										{
											//===================================
											// 코드_가__같으면
											IF ($var_val == $val["code"])					$get__val = $val["name"];
										}

									BREAK;
									// 끝 => 코드_로__번호__알아내기
									//=======================================


									//=======================================
									// 시작 => 번호_로__모두_가져오기
									CASE "num_all" :

										WHILE (list($key, $val) = each($arrs))
										{
											// 모두 가져오기 배열에 저장
											IF ($var_val == $val["num"])					$get__val = $val;
										}

									BREAK;
									// 끝 => 번호_로__모두_가져오기
									//=======================================


									//=======================================
									// 시작 => 코드로__모두_가져오기
									CASE "code_all" :

										WHILE (list($key, $val) = each($arrs))
										{
											// 모두 가져오기 배열에 저장
											IF ($var_val == $val["code"])					$get__val = $val;
										}

									BREAK;
									// 끝 => 코드로__모두_가져오기
									//=======================================


									//=======================================
									// 시작 => 이름으로__모두_가져오기
									CASE "name_all" :

										WHILE (list($key, $val) = each($arrs))
										{
											// 모두 가져오기 배열에 저장
											IF ($var_val == $val["name"])					$get__val = $val;
										}

									BREAK;
									// 끝 => 이름으로__모두_가져오기
									//=======================================

								}
								// 끝 => 원하는_정보__가져오는_방식
								//=========================================


								//=========================================
								// 값__없으면
								IF (!$get__val)										 					$get__val = 0;

							}
							// 끝 => 배열_건수__있으면
							//===========================================

						}
						// 끝 => 조건_값__있으면
						//=============================================

					}
					// 끝 => 조건_필드__있으면
					//===============================================

				}
				# 끝 => 배열이면
				###################################################


				//=================================================
				// 넘겨주기
				return $get__val;

			}
			#####################################################
			# 끝 => 배열에서_정보__뽑아내기
			#####################################################



			#####################################################
			# 시작 => 이미지_썸네일__삭제
			#####################################################
			function delete_thumbnail($dir, $file)
			{
				if(!$dir || !$file)
						return;

				$filename = preg_replace("/\.[^\.]+$/i", "", $file); // 확장자제거

				$files = glob($dir.'/thumb-'.$filename.'*');

				if(is_array($files)) {
						foreach($files as $thumb_file) {
								@unlink($thumb_file);
						}
				}

			}
			#####################################################
			# 끝 => 이미지_썸네일__삭제
			#####################################################



			#####################################################
			# 시작 => 입력_폼_안내문__출력
			#####################################################
			function echo_help($help_s="")
			{
					global $g5;

					$str	= '<span class="frm_info">'.str_replace("\n", "<br />", $help_s).'</span>';

					echo $str;
			}
			#####################################################
			# 끝 => 입력_폼_안내문__출력
			#####################################################



			#####################################################
			# 시작 => 탈퇴__했으면
			#####################################################

			//===================================================
			// 시작 => 회원__이면
			IF ($is_member)
			{

					//===============================================
					// 시작 => 탈퇴__했으면
					IF ($member['mb_leave_date'])
					{

							//===============================================
							// 시작 => URL_이__로그아웃__아니면
							IF (!eregi("/logout.php", $_SERVER["REQUEST_URI"]))
							{

									//===========================================
									// 로그아웃
									$move_url = G5_BBS_URL."/logout.php?url=".urlencode("http://".$_SERVER["HTTP_HOST"].$_SERVER["REQUEST_URI"]);
									goto_url($move_url);
									EXIT;

							}
							// 끝 => URL_이__로그아웃__아니면
							//===============================================

					}
					// 끝 => 탈퇴__했으면
					//===============================================

			}
			// 끝 => 회원__이면
			//===================================================

			#####################################################
			# 끝 => 탈퇴__했으면
			#####################################################

	#########################################################
	# 끝 => 공통
	#########################################################






	#########################################################
	# 시작 => 760003__ATTEND_CHECK__출석체크
	#########################################################

			#####################################################
			# 시작 => 기본_상수
			#####################################################

			//===================================================
			// 끌어올림__프로그램_번호
			define('PIREE_FREE_ATTEND_PROG_N',	'760003');


			//===================================================
			// 레벨_도우미
			define('PIREE_FREE_ATTEND_CHECK_DIR',		'p'.PIREE_FREE_ATTEND_PROG_N.'__attend_check');
			define('PIREE_FREE_ATTEND_CHECK_URL',		PIREE_URL.'/'.PIREE_FREE_ATTEND_CHECK_DIR);
			define('PIREE_FREE_ATTEND_CHECK_PATH',	PIREE_PATH.'/'.PIREE_FREE_ATTEND_CHECK_DIR);

			#####################################################
			# 끝 => 기본_상수
			#####################################################

	#########################################################
	# 끝 => 760003__ATTEND_CHECK__출석체크
	#########################################################


?>