<?php

/*
===========================================================

	프로젝트 이름 : Piree WON Program

	만든사람 : 피리

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2014년 01월 22일 수요일 오전 05시 37분, 날씨 추워~ B급으로 추워~

	저 작 권 : Copyright ⓒ 2014 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 > 
===========================================================


*/


	//=======================================================
	// 개별_페이지__접근_불가
	IF (!defined('_GNUBOARD_'))					EXIT;


	//=======================================================
	// HEAD_첨부
	// include_once (G5_PATH."/head.php");
	include_once ("../../head.php");

?>