<?php

/*
===========================================================

	프로젝트 이름 : Piree WON Program

	만든사람 : 피리

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2014년 01월 13일 월요일 오전 03시 15분 - 날씨 춥다 추워

	저 작 권 : Copyright ⓒ 2014 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 > 피리 레벨 도우미 FREE > 스킨
===========================================================


*/


	//=======================================================
	// 개별_페이지__접근_불가
	IF (!defined("_GNUBOARD_"))										EXIT; 


?>

<!-- 시작 => 내가__몸통이다 -->

<section>
		<h2>레벨 변경 신청하기 >> 현재 레벨 <?php echo $mb_level; ?> ( <?php echo $member_level_arr[$mb_level]; ?> )</h2>

		<form name="level_update_form" id="level_update_form" action="<?php echo PIREE_PLUS_LEVEL_HELPER_PATH; ?>/pi__level.update.php" onsubmit="return level_list_submit(this);" method="post">
		<input type="hidden" name="level_choice_n" value="0">

		<div class="tbl_head01 tbl_wrap">
				<table>
				<caption style="height:20px;">레벨 변경 신청하기</caption>
				<thead>
				<tr>
						<th scope="col">레벨</th>
						<th scope="col">레벨 이름</th>
						<th scope="col">기준 포인트 점수</th>
						<th scope="col">신청하기</th>
						<th scope="col">비고</th>
				</tr>
				</thead>
				<tbody>

<?php

	//=======================================================
	// 시작 => 레벨__설정_정보__유무
	IF ($level_config_t > 0)
	{

		#######################################################
		# 시작 => 레벨__설정_정보__있으면
		#######################################################

		//=====================================================
		// 시작 => 반복문__돌리기
		WHILE (list($key, $val) = each($level_config_arr))
		{

			//===================================================
			// 시작 => 관리자__아니면
			IF ($val["is_admin_n"] == 0)
			{

				//=================================================
				// 비고
				$etc_msg = "";


				//=================================================
				// 신청_가능__여부
				// 0 - 신청안해
				// 1 이상 - 신청하자
				$is_request = 0;


				//=================================================
				// 레벨_번호
				$level_n = $val["level_n"];


				//=================================================
				// 포인트_점수
				$point_fm = number_format($val["point_n"]);


				//=================================================
				// 등록일시
				$regdate_s = date("y.m.d", $val["regtm_n"]);


				//=================================================
				// 시작 => 현재_레벨과__비교
				IF ($level_n == $mb_level)
				{

					//===============================================
					// 시작 => 현재_레벨과__같으면

					// 비고
					$etc_msg = "현재 레벨입니다";

				}
				ELSE IF ($level_n > $mb_level)
				{

					//===============================================
					// 시작 => 현재_레벨보다__높으면

					// 신청하자
					$is_request++;

				}
				// 끝 => 현재_레벨과__비교
				//=================================================

?>
				<tr>
						<td align="center"><strong><?php echo $level_n ?></strong></td>
						<td><strong><?php echo $val["level_s"] ?></strong></td>
						<td align="right"><?php echo $point_fm ?> 점</td>
<?php

					//===============================================
					// 시작 => 레벨_신청__가능_여부
					IF ($is_request > 0)
					{

						###############################################
						# 시작 => 레벨_신청할수__있으면
						###############################################

						/*
						<td align="center"><a href="javascript:;" onClick="level_request_form(this.form, <?php echo $level_n ?>);" class="btn_b01">신청하기</a></td>
						*/

?>
						<td align="center"><input type="button" value="신청하기" onClick="level_request_form(this.form, <?php echo $level_n ?>);" class="btn_submit"></td>
<?
					}
					ELSE
					{

						###############################################
						# 시작 => 레벨_신청할수__못하면
						###############################################

?>
						<td class="no_use">신청할수 없습니다.</td>
<?
					}
					// 끝 => 레벨_신청__가능_여부
					//===============================================

?>
						<td><?php echo $etc_msg ?></td>
				</tr>

<?php
			}
			// 끝 => 관리자__아니면
			//===================================================

		}
		// 끝 => 반복문__돌리기
		//=====================================================

		#######################################################
		# 끝 => 레벨__설정_정보__있으면
		#######################################################

	}
	ELSE
	{

		#######################################################
		# 시작 => 레벨__설정_정보__없으면
		#######################################################

?>
				<tr>
					<td colspan="9">
						<strong>현재 레벨 정보가 없습니다.</strong>
					</td>
				</tr>

<?php

		#######################################################
		# 끝 => 레벨__설정_정보__없으면
		#######################################################

	}
	// 끝 => 레벨__설정_정보__유무
	//=======================================================

?>

				</tbody>
				</table>
		</div>

		</form>


		<div style="padding:5px 0 5px 0; line-height:1.9em;">
			⊙ 원하시는 레벨로 "신청하기" 버튼을 눌러 주세요.<br>
			⊙ "신청할수 없습니다." 는 현재 레벨이 더 높은 경우 입니다.
		</div>

</section>

<!-- 끝 => 내가__몸통이다 -->


	<script>
	function level_request_form(gform, level_n)
	{

		//=====================================================
		// FORM__레벨_값_필드__초기화
		gform.level_choice_n.value = 0;


		//=====================================================
		// 시작 => 레벨__있으면
		if (level_n > 0)
		{

			//===================================================
			// 시작 => 확인
			if (confirm("정말로 레벨 변경 신청하시겠습니까??") == true)
			{

				//=================================================
				// FORM__레벨_값_필드__값__지정
				gform.level_choice_n.value = level_n;


				//=================================================
				// FORM_처리
				gform.submit();

			}
			// 시작 => 확인
			//===================================================

		}
		// 시작 => 레벨__있으면
		//=====================================================

	}
	</script>